[{"title": "Ghana and Colombia strengthen ties as Vice Presidents meet in Accra.", "content": "Vice President Jane Naana Opoku-Agyemang on Thursday welcomed her Colombian counterpart, Francia Elena Márquez Mina, to Accra, marking the second visit by Colombia’s vice president since she took office and signalling a deepening partnership between the two nations.Receiving Her Excellency Márquez Mina, Professor Opoku-Agyemang described the visit as a reaffirmation of “deep, longstanding, and mutually respectful relations” built on shared values and common aspirations.The vice president praised Márquez Mina’s record as a champion of racial equity, human dignity, and reparative justice, which are causes that resonate strongly across Latin America and beyond.She also noted a convergence between Colombia’s efforts to secure reparations for communities affected by slavery and systemic marginalisation and Ghana’s prominent role in global discussions on restorative justice.“Colombia’s commitment to advancing reparations strongly aligns with Ghana’s leadership in this vital discourse,” Vice President Opoku-Agyemang said.On the economic front, the Ghanaian vice president highlighted the African Continental Free Trade Area (AfCFTA) as a strategic gateway for Colombian businesses seeking access to Africa’s emerging single market of 1.3 billion people.“Ghana stands ready to serve as Colombia’s natural entry point into this vast market,” she said, identifying agriculture, digital innovation, climate resilience, and trade investment as promising areas for collaboration. She noted that improved air and maritime connectivity between the two countries would be essential to unlocking this potential.The meeting concluded with the signing of a Memorandum of Understanding between Colombia’s Diplomatic Academy and Ghana’s Foreign Service Institute, formalising academic cooperation and institutional exchanges between the two countries’ diplomatic training bodies.Both countries hailed their relationship as a model of effective South-South cooperation and a collaboration between developing countries that bypasses traditional North-South development frameworks.", "link": "https://presidency.gov.gh/ghana-and-colombia-strengthen-ties-as-vice-presidents-meet-in-accra/", "published_date": "12 December 2025"}, {"title": "President Mahama arrives in Kenya for Jamhuri Day.", "content": "President John Dramani Mahama has arrived in Nairobi, Kenya, for an official visit at the invitation of His Excellency William Samoei Ruto, President of Kenya.President Mahama is the Chief Guest at Kenya’s Jamhuri Day celebration on Friday. Jamhuri Day is a significant national event that commemorates Kenya’s independence and showcases the country’s rich cultural heritage.President Mahama was warmly received at Jomo Kenyatta International Airport shortly after midnight Kenya time by the Cabinet Secretary for the Ministry of Foreign Affairs and Diaspora Affairs, H.E. Musalia Mudavadi, and other senior government officials.Following the celebrations, President Mahama will attend a luncheon at the State House hosted by President Ruto, which will provide an opportunity for bilateral discussions between the two leaders.President Mahama is accompanied on this visit by Dr Callistus Mahama, Executive Secretary to the President, and Stanislav Xoese Dogbe, Deputy Chief of Staff, Operations.The President is scheduled to depart Kenya on Saturday.", "link": "https://presidency.gov.gh/president-mahama-arrives-in-kenya-for-jamhuri-day/", "published_date": "12 December 2025"}, {"title": "President Mahama hints at involving the Red Cross in Free Primary Healthcare implementation.", "content": "President John Dramani Mahama has indicated the government’s plan to engage civil society volunteers in implementing the Free Primary Healthcare Programme upon its launch.He disclosed this during a courtesy call by the President of the Ghana Red Cross Society, Dr Edward Donkor, and Dr Ghulam Mohammed Awam, Head of Delegation of the International Federation of Red Cross and Red Crescent Societies, Abuja Cluster, which is responsible for Ghana, Nigeria, Togo, and Benin.“So, we’re attacking the challenges on two fronts, one with the Ghana Medical Trust Fund called Mahama Care, and then with the Free Primary Healthcare.”He explained that the Free Primary Healthcare Programme is designed to complement efforts to improve access to and treatment of healthcare, ensuring a healthy society.“It is supposed to be a wellness activity, preventive, so that we reduce the disease burden, especially when it comes to non-communicable diseases. A lot of times, people get a cardiac incident because they don’t even know that they are hypertensive,” he explained.The President said in the 2026 Budget, an allocation of GHS 2.1 billion has been made to kick-start the Ghana Medical Trust Fund (MahamaCares), adding that its registration portal will soon open for patients diagnosed with critical ailments, such as cancer, liver, and kidney diseases, who need treatment.The visit was to give the Society’s leadership an opportunity to appraise their Patron on their achievements and present to him the challenges that require urgent redress.President Mahama congratulated the Red Cross Society on its impact over the past years and promised to allocate budget funds to support its operations.The Ghana Red Cross Society is a volunteer-based humanitarian organisation that provides disaster response, first aid training, health education, and community support to prevent and alleviate human suffering.", "link": "https://presidency.gov.gh/president-mahama-hints-at-involving-the-red-cross-in-free-primary-healthcare-implementation/", "published_date": "11 December 2025"}, {"title": "COVID‑19 Health Recovery Levy abolished.", "content": "President John Dramani Mahama has assented to the COVID‑19 Health Recovery Levy Repeal Act 2025. This is in fulfilment of his campaign promise to scrap the tax he described as difficult to accept, especially since Ghana became the only country to tax its citizens for a pandemic that had ended.“Ghana remains the only country that is taxing its citizens for a pandemic that has passed, and it is my honour and privilege to repeal the COVID Levy. Promise made, Promise delivered,” President Mahama stated after appending his signature on Wednesday, December 10, 2025.“A lot of Ghanaians have disliked this tax. They purported to provide free water, electricity, food, and more. To the shock of many Ghanaians, after the pandemic was over and after the 2020 elections, the government slapped Ghanaians with a 1% Value Added Tax ostensibly to recover what they are supposed to have spent on the COVID pandemic”, he added.", "link": "https://presidency.gov.gh/covid-19-health-recovery-levy-abolished/", "published_date": "10 December 2025"}, {"title": "Mahama Attends Doha Forum 2025 at Invitation of Qatari Emir", "content": "President John Dramani Mahama is in Doha, Qatar, to participate in the Doha Forum 2025 at the invitation of the Emir of Qatar.Mr Mahama who arrived in Doha on Saturday morning will make two critical interventions during the Forum, an opening remark on “Education as Justice in Times of Crisis” and join a panel to discuss Economic Empowerment in Africa: Pathway to Inclusive Prosperity.President Mahama will also hold talks with H.H. Sheikh Tamim bin Hamad Al Thani, Emir of Qatar.The president traveled to Doha aboard a Qatar Airways Executive Jet provided by the State of Qatar and will leave Doha on Sunday.", "link": "https://presidency.gov.gh/mahama-attends-doha-forum-2025-at-invitation-of-qatari-emir/", "published_date": "06 December 2025"}, {"title": "President Mahama hands over 40 armoured vehicles to the Police.", "content": "President John Dramani Mahama, on Thursday, at a ceremony to hand over forty (40) newly acquired armoured police vehicles, assured the nation that his government will go all out to adequately resource the security agencies to combat crime, protect the citizenry and ensure a conducive atmosphere for development.He served notice that the government will not take chances, warning that those who break the law won’t go scot free.The vehicles include fifteen (15) armoured pickups, five Cobra-Four and twenty Cobra-Three special armoured cars fitted with state-of-the-art electronic systems. According to the President, these form part of the first set of hardware and will be supplemented by two tow trucks and ten (10) covert operational vehicles.Government would also give every police district office a pickup for patrol duties.He used the occasion to caution the public against emerging incidents of attacks on law enforcement agencies.“We will give you the right instruments so that as you do your duty, you also are safe and able to come back to your families,” he assured.“Too often, we have lost men in the line of duty because we send them on missions and assignments without providing them with the appropriate equipment to ensure their safety. And that is why from the start of my administration, I committed to retooling and modernising all our security agencies.”President Mahama assured the officers and the families that his government will ensure that these acts of lawlessness become a thing of the past.According to him, the ceremony is not just about machinery and equipment, but “about our readiness, responsibility, and assurance that when danger arises, the state will be there to protect us.”“These vehicles have been procured as operational tools, not as symbols. They are designed to strengthen police response in high-risk environments. They enhance officer protection when you are engaged in dangerous operations. They reinforce patrols in rugged terrain and high crime zones.”He continued, “Today’s handing over is a significant fulfilment of the commitment I made. Our security policy is anchored on a simple truth. Peace is not accidental. Peace is built and established through investment, institutional strengthening, professionalism, and vigilance.”", "link": "https://presidency.gov.gh/president-mahama-hands-over-40-armoured-vehicles-to-the-police/", "published_date": "05 December 2025"}, {"title": "Lordina Mahama Hosts African First Ladies for Major ICASA Health Summit", "content": "Her Excellency Dr Fatima Maada Bio, First Lady of Sierra Leone & President of the Organisation of African First Ladies for Development, and Her Excellency Fatoumatta Bah Barrow, First Lady of The Gambia, have arrived in Accra for an African First Ladies high-level side event as part of the 23rd International Conference on AIDS and STIs in Africa (ICASA).Thursday’s meeting, being hosted by Ghana’s First Lady, H.E. Lordina Dramani Mahama, is on Ending Mother-to-Child Transmission and the Triple Elimination of HIV, Syphilis, and Hepatitis B in Africa. The engagement will focus on the role of women in leadership in complementing efforts to fight stigmatisation, abuse, and neglect of victims, especially women and children, as well as concrete steps to protect their rights in society.Mrs Mahama and her Lordina Foundation have earned international recognition for their advocacy to promote health and humanitarian assistance for the vulnerable over the past decade.In 2013, she was appointed a Health Ambassador to support the Heart-to-Heart campaign and to champion the course of HIV/AIDS patients in Ghana. In February 2016, Mrs Mahama, then as President of the Organisation of African First Ladies against HIV/AIDS (OAFLA), delivered an emotional message on the need for a proactive response to HIV and the sexual and reproductive rights of young people at the 7th Africa Conference on Sexual Health and Rights, held in Accra.Also expected in Accra for the high-level meeting are the First Ladies of Kenya, Liberia, and a former First Lady of South Africa.", "link": "https://presidency.gov.gh/1723-2/", "published_date": "03 December 2025"}, {"title": "Presidency Communications newsletter, Dec. 02, 2025", "content": "Click below to read the Presidency communications newsletter from Dec. 02, 2025.The Presidency Communications#PromisesDelivered#MahamaThePresiden", "link": "https://presidency.gov.gh/presidency-communications-newsletter-dec-02-2025/", "published_date": "03 December 2025"}, {"title": "Accra Reset: Speech by H.E. President Olusegun Obasanjo at the G20 Leaders’ Summit, Johannesburg, South Africa.", "content": "Your Excellencies,Distinguished Heads of State and Government,I am here for the Accra Reset, a global South-anchored platform.Allow me to begin by conveying special greetings from H.E. John Dramani Mahama, President of the Republic of Ghana, and African Union Champion for Reparations, the African Union’s continental theme for this year. He is also spearheading Accra Reset. President Mahama extends his deep appreciation to H.E. President Cyril Ramaphosa, whose leadership has guided this G20 cycle with clarity, courage, and profound commitment to justice.Congratulations are due to South Africa and the African Union for their exceptional representation of the aspirations of Africa, Global Africa, and the wider Global South. This Johannesburg Summit has been defined by integrity of purpose, a clear focus on structural reform, and an unwavering commitment to ensure that the G20 delivers progress for all peoples and not just a privileged few.We also acknowledge several important highlights of this year’s Presidency:– the advancement of a more equitable global financial architecture;– the strong emphasis on global health resilience and manufacturing sovereignty;– the renewed momentum around digital public infrastructure and fair technology partnerships;– the focus on inclusive growth and decent jobs; and– the widening of Global South participation in multilateral decision-making.Your Excellencies, these priorities resonate profoundly with the mission that several of your governments helped shape over the last three years. I speak of the Accra Reset, a Global South–anchored ambition to transform development cooperation into a system that is country-led, regionally empowered, and globally coherent.|Today, on this historic platform, we humbly request continued cooperation between the G20, the South African Presidency, the African Union, and the Accra Reset.We are pleased to announce that, as of this month:– the interim Secretariat of the Accra Reset has formally commenced operations in Ghana;– the Circle of Leaders has expanded to include more than two dozen former Heads of State and Heads of International Organisations from Africa, Asia, Latin America, Europe, and the Caribbean;– a High-Level Panel is being convened to prepare a landmark report on restructuring global governance, to be submitted to a commissioning authority composed of Heads of State from across both the Global North and Global South.These developments speak to a simple truth: we are entering a moment in world affairs when durable solutions must be co-created, not imposed; negotiated with fairness, not inherited from history; and built on sovereignty, dignity, common security and shared prosperity.The Accra Reset stands ready to work closely with the G20. It is poised to serve as the connective tissue interlinking the public, private, and civil factions of Global South societies. It aims to work through the African Union and the South African Presidency to advance ongoing G20-enabled reforms in health governance, digital cooperation, development finance, investments with guarantees and assurance for investor, jobs for youth, wealth creation and resilient supply chains.Our history of AID and loans has created an economy of dependency. To move forward, we must re-architect our economies based on trade and investment. We see this cooperation not as a parallel track, but as a strategic reinforcement of the agenda in finance and financial architecture championed in Leaders Declaration of 2025 G20 Summit in South Africa, mindful of inadequacy of AID which is drying up and borrowing which has become counterproductive for human capital development in Global Africa.Your Excellencies,On behalf of the interim Presidential Council, the Circle of Leaders, and the global coalition behind the Accra Reset, I express profound gratitude to President Ramaphosa, and all G20 members for the opportunity to mark the beginning of a new partnership between the G20 and the Accra Reset.We stand ready to work, and to do so with humility, discipline, and unwavering resolve, to help shape a workable multilateral order for finance for development and for investment for this generation and the next. Through our collective efforts, we shall transition the international development system from endless aspirational targets to workable business models that drive real and durable change and collaboration for mutual interest.Thank you for listening.", "link": "https://presidency.gov.gh/accra-reset-speech-by-h-e-president-olusegun-obasanjo-at-the-g20-leaders-summit-johannesburg-south-africa/", "published_date": "03 December 2025"}, {"title": "President Mahama marks 67th birthday visiting children’s wards.", "content": "President John Dramani Mahama celebrated his 67th birthday on Saturday, with visits to children’s wards in two local healthcare facilities, here in Accra to spread joy and offer support to the young patients and their families.The President, accompanied by his wife and children, visited the LEKMA Hospital and Maamobi Polyclinic, where he donated gifts of various items and cash to each child receiving treatment and their parents.President Mahama also expressed his appreciation to the medical staff and presented monetary gifts for their dedicated service.The birthday visit brought smiles to the faces of young patients and their families, who expressed gratitude for the President’s thoughtful gesture.At LEKMA Hospital, President Mahama facilitated the referral of a young girl to UGMC for further care.Staff at both facilities expressed their gratitude to the President for acknowledging their efforts and for choosing to spend his birthday with them and the patients on admission.", "link": "https://presidency.gov.gh/president-mahama-marks-67th-birthday-visiting-childrens-wards/", "published_date": "29 November 2025"}, {"title": "First Lady interacts with St. Mary’s school girls, donates learning materials and interacts with scholarship beneficiaries.", "content": "Her Excellency the First Lady, Mrs. Lordina Dramani Mahama, has encouraged pupils of St Mary’s Basic and Junior High School at Korle Gonno in Accra to be confident and not deterred by societal stereotypes against girls.She shared the encouraging message during a visit to the school on Thursday, when she presented essential learning materials to support the pupils. Mrs Mahama emphasised the importance of education and self-belief for girls.“Do not be intimidated because you are girls. Be confident in your abilities,” she said, noting that her visit was not only in her capacity as the First Lady and founder of the Lordina Foundation but also as an ambassador for the “Educating Linda Programme.”The “Educating Linda Programme” is an initiative of the Merck Foundation that supports girls from disadvantaged backgrounds to stay in school and pursue their dreams.“This programme is very close to my heart as a woman from a humble background. Education is a transformative tool that changes individuals, families, communities, and nations,” she added.Through a partnership with the Merck Foundation, twenty exceptional girls from the St Mary’s R/C Girls Basic School have been awarded scholarships by the Lordina Foundation to pursue their education.The First Lady presented various school supplies, including exercise books, water bottles, pencil holders, rulers, pencils, erasers, sharpeners, pens, and coloured pencils, to enhance their learning experience.Headmistress of the school, Patience Addy, thanked the Merck and Lordina Foundations for the support, noting that the scholarships have motivated the girls to excel academically.She mentioned that the presence and encouragement of the First Lady would significantly boost their confidence and motivate them to aim higher.The Circuit Supervisor from the Greater Accra Metro Education Office, Martha Breh, who accompanied the delegation, praised the generous donation and remarked that the initiative would inspire the girls to pursue their dreams with resolve.Miss Emelia Mensah, a scholarship beneficiary, expressed profound gratitude for the support. She shared that the scholarship relieved her of the financial burden of school supplies, enabling her to focus fully on her studies.", "link": "https://presidency.gov.gh/first-lady-interacts-with-st-marys-school-girls-donates-learning-materials-and-interacts-with-scholarship-beneficiaries/", "published_date": "21 November 2025"}, {"title": "First Lady takes health services to Sunyani as Bono Region battles high HIV rates.", "content": "First Lady, H.E. Mrs Lordina Dramani Mahama, was in Sunyani on Thursday to organise a community health screening exercise in collaboration with the Ghana AIDS Commission.It was the second in the series of such collaborations, the first being in Accra.In an address before the start of the screening exercise, Mrs Mahama used the opportunity to encourage traditional and religious leaders to leverage their revered positions to foster healthy, responsible behaviour within their communities.The First Lady noted that Ghana remains committed to ending AIDS as a public health threat by 2030, a goal she said is achievable if every individual plays their part.“Parents must engage in open and honest conversations with their children about health and sexuality,” she noted, urging teachers to also guide students with care, wisdom, and accurate information to help eliminate the stigma surrounding HIV.Currently, over 334,000 Ghanaians are living with HIV, and the Bono Region remains one of the most affected areas. This, she said, is a serious concern, and called for education, prevention, and early testing to turn the tide against infections.According to the First Lady, who is also the President of the Lordina Foundation, health is the foundation upon which development is built. She stated that without good health, productivity suffers and affects the building of vibrant communities.Mrs Mahama highlighted the importance of health screening programmes.“I love bringing health services closer to people because when we invest in health, we invest in our collective future”, she said.Osagyefo Oseadeeyo Agyeman Budu II, Dormaahene and President of the Bono Regional House of Chiefs, expressed concern over the rising HIV cases in the Bono Region in recent years, particularly affecting people aged 25 to 40.He stated that the screening programme is a crucial health campaign rather than a political exercise, encouraging all attendees to take advantage of testing and educational resources.Sister Diana, who has been living with HIV since 1989, shared her experience battling stigma due to limited awareness. She emphasised that with proper care and monitoring, people living with HIV can lead healthy lives.“My children’s support gave me strength,” she said, “and motivated me to educate others as an ambassador for HIV awareness.”", "link": "https://presidency.gov.gh/first-lady-takes-health-services-to-sunyani-as-bono-region-battles-high-hiv-rates/", "published_date": "14 November 2025"}]
